Documents/ФинОтчетВБанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ФинОтчетВБанк</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭкономическиеСубъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключатьОбособленныеПодразделения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отчетность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиОтчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиКомплекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлОтчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УточнениеНаименования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлОтчетаСодержитЭП</Name>
							<Comment>Истина, если ФайлОтчета содержит ссылку на присоединный zip-архив, внутри которого есть в том числе файлы электронных подписей</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияДанныхОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиОтчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиСистемыНалогообложения</Name>
					<Comment>Заполняются при загрузке пакетов отчетности других компаний группы, которые ведут учет в собственных базах 1С:Бухгалтерии</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиСубъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемаНалогообложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНДоходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНДоходыМинусРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяУСНПатент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикТорговогоСбора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяНалогНаПрофессиональныйДоход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФинОтчетВБанк/Forms/НавигацияПоОшибкам/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ФинОтчет.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Не задан фин.отчет для открываемой формы навигации по ошибкам'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.АдресРезультата)
	 Или Не ЭтоАдресВременногоХранилища(Параметры.АдресРезультата) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ПредставленияСтрокОтчетов) Тогда
		// Должна быть структура из двух соответствий Отчеты и Субъекты, где ключ = КлючСтрокиОтчета.
		ВызватьИсключение НСтр("ru = 'Не заданы представления ключей строк для открываемой формы навигации по ошибкам'");
	КонецЕсли;
	
	// Получим информацию из пакета фин.отчетности.
	ИнформацияПакета = ПолучитьИзВременногоХранилища(Параметры.АдресРезультата);
	Если ИнформацияПакета = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОтчетностьПоКлючамСтрок = ИнформацияПакета.ОтчетностьПоКлючамСтрок;
	СтрокиБезОшибок = ОтчетностьПоКлючамСтрок.НайтиСтроки(Новый Структура("ОписаниеОшибки", ""));
	Для каждого Отчет Из СтрокиБезОшибок Цикл
		ОтчетностьПоКлючамСтрок.Удалить(Отчет);
	КонецЦикла;
	КлючиСтрокОтчета = Новый Массив;
	Для каждого Отчет Из ОтчетностьПоКлючамСтрок Цикл
		Если ЗначениеЗаполнено(Отчет.КлючСтрокиОтчета) Тогда
			КлючиСтрокОтчета.Добавить(Отчет.КлючСтрокиОтчета);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФинОтчет", Параметры.ФинОтчет);
	Запрос.УстановитьПараметр("КлючиСтрокОтчета", КлючиСтрокОтчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФинОтчетВБанкОтчетность.КлючСтрокиОтчета КАК КлючСтрокиОтчета,
	|	ФинОтчетВБанкОтчетность.КлючСтрокиСубъекта КАК КлючСтрокиСубъекта
	|ИЗ
	|	Документ.ФинОтчетВБанк.Отчетность КАК ФинОтчетВБанкОтчетность
	|ГДЕ
	|	ФинОтчетВБанкОтчетность.Ссылка = &ФинОтчет
	|	И ФинОтчетВБанкОтчетность.КлючСтрокиОтчета В(&КлючиСтрокОтчета)";
	КлючиСтрокОтчета = Запрос.Выполнить().Выгрузить();
	КлючиСтрокОтчета.Индексы.Добавить("КлючСтрокиОтчета");
	
	ТаблицаСообщенийДерево = РеквизитФормыВЗначение("ТаблицаСообщений");
	СообщенияРегОтчетовДерево = РеквизитФормыВЗначение("СообщенияРегОтчетов");
	
	// Разворачиваем таблицу-входящий параметр в дерево.
	УровеньОтчет = Неопределено;
	ПредставленияСтрокОтчетов = Параметры.ПредставленияСтрокОтчетов;
	ОтборПоКлючу = Новый Структура("КлючСтрокиОтчета");
	Для каждого Отчет Из ОтчетностьПоКлючамСтрок Цикл
		
		СоответствиеКлючей = КлючиСтрокОтчета.Найти(Отчет.КлючСтрокиОтчета, "КлючСтрокиОтчета");
		Если СоответствиеКлючей = Неопределено Тогда
			// Ошибка относится в целом ко всему пакету отчетности.
			УровеньСубъект = ТаблицаСообщенийДерево.Строки.Добавить();
			УровеньСубъект.КлючСтроки     = 99999;
			УровеньСубъект.Представление  = Отчет.Представление;
			УровеньСубъект.ОписаниеОшибки = Отчет.ОписаниеОшибки;
			Продолжить;
			
		КонецЕсли;
		
		УровеньСубъект = ТаблицаСообщенийДерево.Строки.Найти(СоответствиеКлючей.КлючСтрокиСубъекта);
		Если УровеньСубъект = Неопределено Тогда
			
			УровеньСубъект = ТаблицаСообщенийДерево.Строки.Добавить();
			УровеньСубъект.КлючСтроки     = СоответствиеКлючей.КлючСтрокиСубъекта;
			УровеньСубъект.Представление  = ПредставленияСтрокОтчетов.Субъекты[СоответствиеКлючей.КлючСтрокиСубъекта];
			
		КонецЕсли;
		
		Если УровеньОтчет = Неопределено
		 Или УровеньОтчет.КлючСтроки <> Отчет.КлючСтрокиОтчета Тогда

			УровеньОтчет = УровеньСубъект.Строки.Добавить();
			УровеньОтчет.КлючСтроки     = Отчет.КлючСтрокиОтчета;
			УровеньОтчет.Представление  = ПредставленияСтрокОтчетов.Отчеты[Отчет.КлючСтрокиОтчета];
			УровеньОтчет.ОписаниеОшибки = Отчет.ОписаниеОшибки;

		КонецЕсли;
		
		КлючСтрокиРегОтчета = 0;
		Для Каждого РегОтчет Из Отчет.ДетализацияОшибок Цикл
			
			КлючСтрокиРегОтчета = КлючСтрокиРегОтчета + 1;
			
			УровеньРегОтчет = УровеньОтчет.Строки.Добавить();
			УровеньРегОтчет.КлючСтроки     = КлючСтрокиРегОтчета;
			УровеньРегОтчет.Представление  = ?(ПустаяСтрока(РегОтчет.Отчет), Отчет.Представление, РегОтчет.Отчет);
			УровеньРегОтчет.ОписаниеОшибки = РегОтчет.Описание;
			
			СообщениеРегОтчет = СообщенияРегОтчетовДерево.Строки.Найти(РегОтчет.ОтчетДок, "ОтчетДок");
			Если СообщениеРегОтчет = Неопределено Тогда
				
				СообщениеРегОтчет = СообщенияРегОтчетовДерево.Строки.Добавить();
				СообщениеРегОтчет.Отчет            = РегОтчет.Отчет;
				СообщениеРегОтчет.ОтчетДок         = РегОтчет.ОтчетДок;
				СообщениеРегОтчет.КлючСтрокиОтчета = Отчет.КлючСтрокиОтчета;
				
			КонецЕсли;
			
			СообщениеРегОтчет = СообщениеРегОтчет.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СообщениеРегОтчет, РегОтчет);
			СообщениеРегОтчет.КлючСтрокиОтчета = КлючСтрокиРегОтчета;
			
		КонецЦикла;
	
	КонецЦикла; 
	УдалитьИзВременногоХранилища(Параметры.АдресРезультата);
	
	КоличествоОшибок = 0;
	КоличествоОтчетов = 0;
	Для каждого УровеньСубъект Из ТаблицаСообщенийДерево.Строки Цикл
		
		УровеньСубъект.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Строк отчетности с ошибками: %1'"),
			УровеньСубъект.Строки.Количество());
			
		Для каждого УровеньОтчет Из УровеньСубъект.Строки Цикл
			
			КоличествоОтчетов = КоличествоОтчетов + 1;

			КоличествоРегОшибок = УровеньОтчет.Строки.Количество();
			Если КоличествоРегОшибок = 0 Тогда
				
				КоличествоОшибок = КоличествоОшибок + 1;
				
			Иначе
				
				КоличествоОшибок = КоличествоОшибок + КоличествоРегОшибок;
				УровеньОтчет.ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Ошибок в отчете: %1'"), КоличествоРегОшибок);
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СообщенияРегОтчетовДерево, "СообщенияРегОтчетов");
	ЗначениеВРеквизитФормы(ТаблицаСообщенийДерево, "ТаблицаСообщений");
	
	НадписьВсегоОшибок = СтрШаблон(НСтр("ru = 'Всего ошибок: %1 в %2 %3'"),
							Формат(КоличествоОшибок, "ЧГ="),
							Формат(КоличествоОтчетов, "ЧГ="),
							?(КоличествоОтчетов = 1, "отчете", "отчетах"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытьФормуНавигацииПоОшибкамФинОтчетности"
	   И Источник = Параметры.ФинОтчет Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	Если ТекРодитель = Неопределено Тогда
		// Верхний уровень не расшифровываем.
		Возврат;

	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Если ТекРодитель.ПолучитьРодителя() = Неопределено Тогда // переходим к строке пакета отчетности
		
		АктивизироватьСтрокуОтчетности(ТекДанные);
		
	Иначе // переходим к ячейке регламентированного отчета
		
		ОткрываемыйОтчет = Неопределено;
		Для каждого СообщениеРегОтчет Из СообщенияРегОтчетов.ПолучитьЭлементы() Цикл
			Если СообщениеРегОтчет.КлючСтрокиОтчета = ТекРодитель.КлючСтроки Тогда
				ОткрываемыйОтчет = СообщениеРегОтчет;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОткрываемыйОтчет = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОткрываемаяЯчейка = Неопределено;
		Для каждого СообщениеРегОтчет Из ОткрываемыйОтчет.ПолучитьЭлементы() Цикл
			Если СообщениеРегОтчет.КлючСтрокиОтчета = ТекДанные.КлючСтроки Тогда
				ОткрываемаяЯчейка = СообщениеРегОтчет;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОткрываемаяЯчейка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		АктивизироватьЯчейкуРегламентированногоОтчета(ОткрываемаяЯчейка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьСтрокуОтчетности(ВыбраннаяСтрока)
	
	Отчет = Новый Структура;
	Отчет.Вставить("КлючСтрокиОтчета",   ВыбраннаяСтрока.КлючСтроки);
	Отчет.Вставить("КлючСтрокиСубъекта", ВыбраннаяСтрока.ПолучитьРодителя().КлючСтроки);
	
	ПараметрыФормы = Новый Структура("Ключ", Параметры.ФинОтчет);
	
	ФормаОтчетности = ОткрытьФорму("Документ.ФинОтчетВБанк.Форма.ФормаДокумента", ПараметрыФормы);
	
	ФормаОтчетности.АктивизироватьЯчейку(Отчет);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьЯчейкуРегламентированногоОтчета(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекДок = ВыбраннаяСтрока.ОтчетДок;
	Если ТекДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ячейка = Новый Структура;
	Ячейка.Вставить("Раздел", ВыбраннаяСтрока.Раздел);
	Ячейка.Вставить("Страница", ВыбраннаяСтрока.Страница);
	Ячейка.Вставить("Строка", ВыбраннаяСтрока.Строка);
	Ячейка.Вставить("Графа", ВыбраннаяСтрока.Графа);
	Ячейка.Вставить("СтрокаПП", ВыбраннаяСтрока.СтрокаПП);
	Ячейка.Вставить("ИмяЯчейки", ВыбраннаяСтрока.ИмяЯчейки);
	Ячейка.Вставить("Описание", ВыбраннаяСтрока.Описание);
	
	Попытка
	    // Использован код, взятый из ФормаНавигацииПоОшибкам у документа ВыгрузкаРегламентированныхОтчетов.
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета");
		ПараметрыФормы.Вставить("мСохраненныйДок");
		ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета");
		ПараметрыФормы.Вставить("Организация");
		ПараметрыФормы.Вставить("мВыбраннаяФорма");
		ПараметрыФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417",
								РегламентированнаяОтчетностьКлиент.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417());
		
		ФормаРеглОтчета = РегламентированнаяОтчетностьВызовСервера.ПолучитьСсылкуНаФормуРеглОтчета(ТекДок, ПараметрыФормы);
		Если СтрНайти(ФормаРеглОтчета, "РегламентированныйОтчетСтатистикаПрочиеФормы") > 0 Тогда
			ФормаРеглОтчета = ?(СтрНайти(ФормаРеглОтчета, "_") = 0, ФормаРеглОтчета, Лев(ФормаРеглОтчета, СтрНайти(ФормаРеглОтчета, "_") - 1));
		КонецЕсли;
		
		Если СтрЧислоВхождений(ФормаРеглОтчета, "ОтчетМенеджер") > 0 Тогда
			
			ФормаРеглОтчета = СтрЗаменить(ФормаРеглОтчета, "ОтчетМенеджер.", "");
			ФормаРеглОтчета = ОткрытьФорму("Отчет." + ФормаРеглОтчета, ПараметрыФормы, , ПараметрыФормы.мСохраненныйДок);
			
		ИначеЕсли СтрЧислоВхождений(ФормаРеглОтчета, "ВнешнийОтчетОбъект") > 0 Тогда
			
			ФормаРеглОтчета = СтрЗаменить(ФормаРеглОтчета, "ВнешнийОтчетОбъект.", "");
			ФормаРеглОтчета = ОткрытьФорму("ВнешнийОтчет." + ФормаРеглОтчета, ПараметрыФормы, , ПараметрыФормы.мСохраненныйДок);
			
		КонецЕсли;
		
		ФормаРеглОтчета.АктивизироватьЯчейку(Ячейка);
	
	Исключение
		// Регистрируем ошибку в журнале регистрации.
		ЗаписьИсключенияВЖурналРегистрации(Параметры.ФинОтчет, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписьИсключенияВЖурналРегистрации(Знач ФинОтчет, Знач Комментарий)
	
	ИмяСобытия = НСтр("ru = 'Переход к ячейке с ошибкой'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
		ЗаполнениеФинОтчетностиВБанки.СобытиеЖурналаРегистрации(ИмяСобытия),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Документы.ФинОтчетВБанк,
		ФинОтчет,
		Комментарий);

КонецПроцедуры
		
#КонецОбласти
